v2206/Projects/validatioin_CHAD/cavity_piso_Smag/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       50880;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          480;
        startFace       51040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          51200;
        startFace       51520;
    }
)

// ************************************************************************* //
